# Курс "Программирование на языке Python. Уровень 4. Анализ и визуализация данных на языке Python. Библиотеки numpy, pandas, matplotlib"

## Библиотека pandas. Работа с датасетами.

- Загрузка датасетов
- Обработка отсутствующих данных
- Поиск и удаление дублей
- Создание новых признаков, функции ```apply()``` и ```applymap()```
- Сохранение датасетов

In [1]:
# загрузите необходимые библиотеки
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

### Загрузка датасетов

Pandas поддерживает загрузку данных из множества источников.   
Чаще всего придется работать с данными в форматах CSV, XLSX и JSON, а также загружать их из базы данных.

Рассмотрим загрузку данных из файла формата csv - данных, разделенных запятыми.  
Посмотрим содержимое файла, который мы будем загружать:

In [3]:
with open('data/load_example1.csv') as f:
    print(f.read())

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo
16,,18,18,bar
9,10,11,12,baz
1,2,3,4,hello
0,1,,,xxx
7,6,5,,yyy

Для загрузки будем использовать функцию ```pd.read_csv()```. Укажите в качестве параметра имя файла.

In [4]:
df = pd.read_csv('data/load_example1.csv')
df

    a     b     c     d message
0   1   2.0   3.0   4.0   hello
1   5   6.0   7.0   8.0   world
2   9  10.0  11.0  12.0     foo
3  16   NaN  18.0  18.0     bar
4   9  10.0  11.0  12.0     baz
5   1   2.0   3.0   4.0   hello
6   0   1.0   NaN   NaN     xxx
7   7   6.0   5.0   NaN     yyy

Обратите внимание, как ведет себя функция по умолчанию:
 - названия колонок соответствуют содержимому первой строки файла
 - индекс по умолчанию - последовательность чисел.
 
Чтобы ```read_csv()``` включила первую строку в наш DataFrame, передайте ей параметр ```header=None```:

In [5]:
df = pd.read_csv('data/load_example1.csv', header=None)
df

    0    1    2    3        4
0   a    b    c    d  message
1   1    2    3    4    hello
2   5    6    7    8    world
3   9   10   11   12      foo
4  16  NaN   18   18      bar
5   9   10   11   12      baz
6   1    2    3    4    hello
7   0    1  NaN  NaN      xxx
8   7    6    5  NaN      yyy

Также можно задать названия столбцов самостоятельно:

In [8]:
df = pd.read_csv('data/load_example1.csv', names=['aa', 'bb', 'cc', 'dd', 'mmessage'])
df

   aa   bb   cc   dd mmessage
0   a    b    c    d  message
1   1    2    3    4    hello
2   5    6    7    8    world
3   9   10   11   12      foo
4  16  NaN   18   18      bar
5   9   10   11   12      baz
6   1    2    3    4    hello
7   0    1  NaN  NaN      xxx
8   7    6    5  NaN      yyy

Чтобы указать, что один из столбцов - индекс, используйте параметр `index_col`, там можно указать либо название поля, либо его порядковый номер:

In [9]:
df = pd.read_csv('data/load_example1.csv', index_col='message')
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [12]:
df.index
df.index.name

Index(['hello', 'world', 'foo', 'bar', 'baz', 'hello', 'xxx', 'yyy'], dtype='object', name='message')

'message'

In [15]:
# или по индексу столбца
df = pd.read_csv('data/load_example1.csv', index_col=4)
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [20]:
# или 
df = pd.read_csv('data/load_example1.csv', index_col=3)
df

       a     b     c message
d
4.0    1   2.0   3.0   hello
8.0    5   6.0   7.0   world
12.0   9  10.0  11.0     foo
18.0  16   NaN  18.0     bar
12.0   9  10.0  11.0     baz
4.0    1   2.0   3.0   hello
NaN    0   1.0   NaN     xxx
NaN    7   6.0   5.0     yyy

Чтобы пропустить те или иные строки, используйте параметр ```skiprows```, ему можно передать список строк, которые надо пропустить:

In [21]:
df = pd.read_csv('data/load_example1.csv', skiprows=[0,1])
df

    5     6     7     8  world
0   9  10.0  11.0  12.0    foo
1  16   NaN  18.0  18.0    bar
2   9  10.0  11.0  12.0    baz
3   1   2.0   3.0   4.0  hello
4   0   1.0   NaN   NaN    xxx
5   7   6.0   5.0   NaN    yyy

Чтобы переименовать колонки используем функцию `.rename()`

In [22]:
# https://stackoverflow.com/questions/11346283/renaming-column-names-in-pandas
df.columns
df.rename(columns={'5': 'first'}, inplace=False)
df.columns
df

Index(['5', '6', '7', '8', 'world'], dtype='object')

   first     6     7     8  world
0      9  10.0  11.0  12.0    foo
1     16   NaN  18.0  18.0    bar
2      9  10.0  11.0  12.0    baz
3      1   2.0   3.0   4.0  hello
4      0   1.0   NaN   NaN    xxx
5      7   6.0   5.0   NaN    yyy

Index(['5', '6', '7', '8', 'world'], dtype='object')

    5     6     7     8  world
0   9  10.0  11.0  12.0    foo
1  16   NaN  18.0  18.0    bar
2   9  10.0  11.0  12.0    baz
3   1   2.0   3.0   4.0  hello
4   0   1.0   NaN   NaN    xxx
5   7   6.0   5.0   NaN    yyy

Обратите внимание: указанные строки вообще не участвуют в разборе файла!

При разборе CSV-файлов также могут встретиться следующие трудности:
 - вместо отсутствующих данных могут быть строки типа "NULL", "n/a" и т.п.
 - разделителями могут быть символы ";" (особенно при выгрузке данных из русской версии Microsoft Excel), или же символ табуляции.
 
Со всем этим может справиться функция ```read_csv()```.  
Загрузим файл ```data/load_example2.csv```

In [23]:
with open('data/load_example2.csv', encoding='utf-8') as f:
    print(f.read())

col1;col2;col3
1;2;3
4;"данные отсутствуют";6
7;8;9
"данные отсутствуют";8;9

 Для указания символа ";" в качестве разделителя, передайте фукнции параметр ```sep=';'```

In [24]:
df = pd.read_csv('data/load_example2.csv', sep=';')
df

                 col1                col2  col3
0                   1                   2     3
1                   4  данные отсутствуют     6
2                   7                   8     9
3  данные отсутствуют                   8     9

In [25]:
df.dtypes

col1    object
col2    object
col3     int64
dtype: object

Для указания нескольких символов в качестве разделителя,  
передайте фукнции параметр `sep='[;:,]'`(регулярное выражение) и `engine='python'`

In [26]:
with open('data/load_example3.csv', encoding='utf-8') as f:
    print(f.read())

col1;col2;col3
1:2	3
4;"данные отсутствуют"	6
7,8;9
"данные отсутствуют";8	9

In [27]:
df1 = pd.read_csv('data/load_example3.csv', engine='python', sep='[;:,\\t]')
df1

                   col1                  col2  col3
0                     1                     2     3
1                     4  "данные отсутствуют"     6
2                     7                     8     9
3  "данные отсутствуют"                     8     9

Чтобы обработать строки "данные отсутствуют" в данном примере, функции ```read_csv()``` нужно передать параметр ```na_values='данные отсутствуют'```

In [28]:
df = pd.read_csv('data/load_example2.csv', sep=';', na_values='данные отсутствуют')
df

   col1  col2  col3
0   1.0   2.0     3
1   4.0   NaN     6
2   7.0   8.0     9
3   NaN   8.0     9

### Обработка отсутствующих данных

С отсутствующими данными в объекте Series можно сделать следующее:
 - удалить функцией ```.dropna()```
 - заполнить подходящим значением, используя функцию ```.fillna()```.
 
Для поиска пустых значений используем функцию ```.isnull()```.
 
Посмотрим, как это работает на примере первого сета. Снова загрузим его.

In [29]:
df = pd.read_csv('data/load_example1.csv', index_col='message')
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

Получить series из позиций в 'b', содержащих NaN, можно используя булеву маску по колонке "b":

In [30]:
df['b'].isnull()   # то же самое df['b'].isna()

message
hello    False
world    False
foo      False
bar       True
baz      False
hello    False
xxx      False
yyy      False
Name: b, dtype: bool

In [31]:
df['b'][df['b'].isnull()]  # df[Столбцы][Строки]
df.b[df.b.isnull()]

message
bar   NaN
Name: b, dtype: float64

message
bar   NaN
Name: b, dtype: float64

Посмотрим, как работает ```.dropna()``` в Series, получим колонку 'b' в виде этого объекта:

In [32]:
b = df['b'].copy()
b

message
hello     2.0
world     6.0
foo      10.0
bar       NaN
baz      10.0
hello     2.0
xxx       1.0
yyy       6.0
Name: b, dtype: float64

Вызовем ```dropna()```:

In [33]:
# Выкидываем целиком строку
bbd = b.dropna()
bbd

message
hello     2.0
world     6.0
foo      10.0
baz      10.0
hello     2.0
xxx       1.0
yyy       6.0
Name: b, dtype: float64

Заполним отсутствующие значения

In [34]:
# можно заполнить конкретным значением
bbf = b.fillna(0)
bbf

message
hello     2.0
world     6.0
foo      10.0
bar       0.0
baz      10.0
hello     2.0
xxx       1.0
yyy       6.0
Name: b, dtype: float64

In [35]:
# а можно средним по всей Series
bbf = b.fillna(b.mean())
bbf

message
hello     2.000000
world     6.000000
foo      10.000000
bar       5.285714
baz      10.000000
hello     2.000000
xxx       1.000000
yyy       6.000000
Name: b, dtype: float64

In [36]:
c = df[['c']] ## Результат датафрейм
c

            c
message
hello     3.0
world     7.0
foo      11.0
bar      18.0
baz      11.0
hello     3.0
xxx       NaN
yyy       5.0

In [40]:
# c
# c.fillna(method='ffill') # forward fill, значение индекса 'hello'  # Старый способ
c.ffill()  # Новый способ

            c
message
hello     3.0
world     7.0
foo      11.0
bar      18.0
baz      11.0
hello     3.0
xxx       3.0
yyy       5.0

In [41]:
# c
# c.fillna(method='bfill') # backward fill, значение индекса 'yyy'  # Это старый способ
c.bfill()  # это новый

            c
message
hello     3.0
world     7.0
foo      11.0
bar      18.0
baz      11.0
hello     3.0
xxx       5.0
yyy       5.0

In [42]:
c_copy = c.copy()
# Берем отдельное значение(скаляр)
c_copy.at['yyy', 'c'] = np.nan
c_copy

            c
message
hello     3.0
world     7.0
foo      11.0
bar      18.0
baz      11.0
hello     3.0
xxx       NaN
yyy       NaN

In [43]:
c_copy.fillna(method='pad')

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13148\820088374.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  c_copy.fillna(method='pad')

            c
message
hello     3.0
world     7.0
foo      11.0
bar      18.0
baz      11.0
hello     3.0
xxx       3.0
yyy       3.0

In [44]:
c.fillna(method='pad')

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13148\1764341390.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  c.fillna(method='pad')

            c
message
hello     3.0
world     7.0
foo      11.0
bar      18.0
baz      11.0
hello     3.0
xxx       3.0
yyy       5.0

В случае с DataFrame это работает похожим образом, только функция удаляет строки, в которых встречается хотя бы одно незаполненное значение:

In [45]:
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [46]:
df.dropna()

         a     b     c     d
message
hello    1   2.0   3.0   4.0
world    5   6.0   7.0   8.0
foo      9  10.0  11.0  12.0
baz      9  10.0  11.0  12.0
hello    1   2.0   3.0   4.0

Этой функции можно задать порог срабатывания, в зависимости от количества __заполненных значений__ в строке. Например, нам нужно удалить только те строки, в которых заполнены как минимум три значения:

In [47]:
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [49]:
# df
df.dropna(thresh=3)  # Порог - 3 заполненных значения

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
yyy       7   6.0   5.0   NaN

Обратите внимание на строку "bar" - несмотря на незаполненную ячейку, она не попала под удаление!

Также можно заполнять отсутствующие данные числами:

In [50]:
df.fillna(100500)

          a         b         c         d
message
hello     1       2.0       3.0       4.0
world     5       6.0       7.0       8.0
foo       9      10.0      11.0      12.0
bar      16  100500.0      18.0      18.0
baz       9      10.0      11.0      12.0
hello     1       2.0       3.0       4.0
xxx       0       1.0  100500.0  100500.0
yyy       7       6.0       5.0  100500.0

Эта функция работает и для заполнения "пробелов" горизонтальными/вертикальными агрегатными вычислениями.

In [53]:
# Среднее по столбцам
df.mean()

a    6.000000
b    5.285714
c    8.285714
d    9.666667
dtype: float64

In [54]:
df.fillna(df.mean())

          a          b          c          d
message
hello     1   2.000000   3.000000   4.000000
world     5   6.000000   7.000000   8.000000
foo       9  10.000000  11.000000  12.000000
bar      16   5.285714  18.000000  18.000000
baz       9  10.000000  11.000000  12.000000
hello     1   2.000000   3.000000   4.000000
xxx       0   1.000000   8.285714   9.666667
yyy       7   6.000000   5.000000   9.666667

In [55]:
df.mean().mean()  # Среднее по всему датафрейму

7.309523809523808

Чтобы эти функции отработали внутри самого объекта и не возвращали его копию, используйте параметр ```inplace=True```.

### Задание

- Замените отсутствующие значения в колонке `b` на среднее по ней
- `c` - на среднее по всей матрице
- `d` - 0.

In [56]:
# pandas.set_option("display.precision", 8)
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

### Решение

In [ ]:
# Ваш код

### Поиск и удаление дублей

Проверить, является ли уникальным индекс, можно, опросив свойство индекса ```is_unique```:

In [57]:
df.loc['hello']

         a    b    c    d
message
hello    1  2.0  3.0  4.0
hello    1  2.0  3.0  4.0

In [58]:
df.index.is_unique

False

In [59]:
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [60]:
df
df.index.duplicated()  ## Второй hello -> True

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

array([False, False, False, False, False,  True, False, False])

In [62]:
~df.index.duplicated() ## ~ - это инверсия

array([ True,  True,  True,  True,  True, False,  True,  True])

Получить булеву маску для дубликатов по индексу можно, вызвав метод ```.duplicated()```. Применение отрицания этой маски вернет DataFrame без строки с дублированным индексом.

In [63]:
df[~df.index.duplicated()]

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [64]:
df.index.get_loc('hello')  # результат работы - булев массив

array([ True, False, False, False, False,  True, False, False])

Тем же методом объекта DataFrame или Series можно получить булеву маску для дубликатов записей в датасете:

In [65]:
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [66]:
df
df.duplicated()

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

message
hello    False
world    False
foo      False
bar      False
baz       True
hello     True
xxx      False
yyy      False
dtype: bool

In [67]:
df_new = df.copy()
# Обрщаение к скаляру по индексу
df_new.iat[0, 3] = 10
df_new
# Проверяем целиком строки
df_new.duplicated()

          a     b     c     d
message
hello     1   2.0   3.0  10.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

message
hello    False
world    False
foo      False
bar      False
baz       True
hello    False
xxx      False
yyy      False
dtype: bool

Методу можно передать параметр ```keep=```, который не будет отмечать признаком True либо первый дубликат (значение first), либо последний (значение last).

In [68]:
# Обход снизу вверх, верхние будут дубликатами
df.duplicated(keep='last')

message
hello     True
world    False
foo       True
bar      False
baz      False
hello    False
xxx      False
yyy      False
dtype: bool

Метод можно вызвать, передав ему список признаков, в которых нужно ограничиться поиском дубликатов:

In [69]:
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [70]:
df
df.duplicated(['d'])

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

message
hello    False
world    False
foo      False
bar      False
baz       True
hello     True
xxx      False
yyy       True
dtype: bool

Удалить дубликаты можно функцией ```drop_duplicates()```. Она работает так же, как и ```duplicated()```, но она возвращает новый DataFrame без дубликатов. Ее можно вызвать с параметром `inplace`.

In [71]:
df.drop_duplicates()

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

In [72]:
df

          a     b     c     d
message
hello     1   2.0   3.0   4.0
world     5   6.0   7.0   8.0
foo       9  10.0  11.0  12.0
bar      16   NaN  18.0  18.0
baz       9  10.0  11.0  12.0
hello     1   2.0   3.0   4.0
xxx       0   1.0   NaN   NaN
yyy       7   6.0   5.0   NaN

### Создание новых признаков, функции apply() и applymap()

С созданием новых признаков на базе существующих данных мы уже знакомы, но часто бывает так, что для вычисления новых признаков нужно применить более сложные процедуры, чем стандартные. Для этого существуют функции ```apply()``` и ```applymap()```.

In [73]:
np.random.seed(555)
df = pd.DataFrame(np.random.randint(1, 20, size=(4, 3)), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df

         b   d   e
Utah    15  10   2
Ohio     5   7  10
Texas   17   1  11
Oregon  17   5   2

Посмотрим, как работает метод ```apply()```. Функция, которая указана в качестве параметра этого метода принимает на вход объект Series - столбец и возвращает значение, которое объединяется в объект Series, структyрно соответствующий строке текущего DataFrame. Для вычисления по строкам и формирования столбцов функции ```apply()``` нужно передать параметр ```axis=1```

In [74]:
df

         b   d   e
Utah    15  10   2
Ohio     5   7  10
Texas   17   1  11
Oregon  17   5   2

In [75]:
# Пример создания и использования анонимных функций
func = lambda a, b: 2 * a + b * a - b ** 0.5 
print(func(8, 5))
print((lambda a, b, c: (a + b + c) / 3)(10, 20, 30))

53.763932022500214
20.0

In [76]:
df
# Функции f и ff эквивалентны:
def f(x):
    #print(x)
    return x.max() - x.min()

# В качестве примера альтернитивного варианта. Результат тот же
ff = lambda x: x.max() - x.min()

print(df.apply(f, axis=1)) # Применяем функцию f к каждому штату(индекс)
print('************* The same **************')
print(df.apply(lambda x: x.max() - x.min(), axis=1))

         b   d   e
Utah    15  10   2
Ohio     5   7  10
Texas   17   1  11
Oregon  17   5   2

Utah      13
Ohio       5
Texas     16
Oregon    15
dtype: int32
************* The same **************
Utah      13
Ohio       5
Texas     16
Oregon    15
dtype: int32

In [77]:
df
df.apply(ff) # Применяем функцию f к каждому столбцу

         b   d   e
Utah    15  10   2
Ohio     5   7  10
Texas   17   1  11
Oregon  17   5   2

b    12
d     9
e     9
dtype: int32

Добавление нового вычисленного признака теперь будет выглядеть так:

In [78]:
df['diff'] = df.apply(f, axis=1)
df

         b   d   e  diff
Utah    15  10   2    13
Ohio     5   7  10     5
Texas   17   1  11    16
Oregon  17   5   2    15

В отличие от ```apply()```, ```applymap()``` вычисляется для каждого элемента и возвращает значение, которое должно быть установлено на его место.

In [79]:
format_ = lambda x: f'{x:.2f}'
df.applymap(format_)  # Это старый способ 
df.map(format_)  # Это новый способ (Use DataFrame.map instead)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13148\1006207194.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(format_)  # Это старый способ

            b      d      e   diff
Utah    15.00  10.00   2.00  13.00
Ohio     5.00   7.00  10.00   5.00
Texas   17.00   1.00  11.00  16.00
Oregon  17.00   5.00   2.00  15.00

            b      d      e   diff
Utah    15.00  10.00   2.00  13.00
Ohio     5.00   7.00  10.00   5.00
Texas   17.00   1.00  11.00  16.00
Oregon  17.00   5.00   2.00  15.00

In [80]:
df
df.applymap(lambda x: x ** 2 if x > 10 else x / 100) #

         b   d   e  diff
Utah    15  10   2    13
Ohio     5   7  10     5
Texas   17   1  11    16
Oregon  17   5   2    15

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13148\280236577.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x ** 2 if x > 10 else x / 100) #

             b     d       e    diff
Utah    225.00  0.10    0.02  169.00
Ohio      0.05  0.07    0.10    0.05
Texas   289.00  0.01  121.00  256.00
Oregon  289.00  0.05    0.02  225.00

Для того, чтобы проделать такую операцию над Series, воспользуйтесь функцией map():

In [81]:
df

         b   d   e  diff
Utah    15  10   2    13
Ohio     5   7  10     5
Texas   17   1  11    16
Oregon  17   5   2    15

In [82]:
df['e'] = df['e'].map(format_)
df

         b   d      e  diff
Utah    15  10   2.00    13
Ohio     5   7  10.00     5
Texas   17   1  11.00    16
Oregon  17   5   2.00    15

In [83]:
# Создаю новую колонку
df['f'] = df['e'].astype(float).map(lambda x: x ** 2 + 3 * x + 1)
df

         b   d      e  diff      f
Utah    15  10   2.00    13   11.0
Ohio     5   7  10.00     5  131.0
Texas   17   1  11.00    16  155.0
Oregon  17   5   2.00    15   11.0

In [84]:
# Выводит количество повторяющихся значений
df['b'].value_counts()

b
17    2
15    1
5     1
Name: count, dtype: int64

In [85]:
df

         b   d      e  diff      f
Utah    15  10   2.00    13   11.0
Ohio     5   7  10.00     5  131.0
Texas   17   1  11.00    16  155.0
Oregon  17   5   2.00    15   11.0

### Анализ и разбор датасета

В качестве примера рассмотрим набор данных о пассажирах затонувшего "Титаника".

In [86]:
titanic = pd.read_csv('data/titanic.csv', index_col='PassengerId')

Чтобы проверить, что у нас все загрузилось корректно, посмотрим на форму получившегося объекта:

In [87]:
titanic.shape

(891, 11)

In [88]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [89]:
titanic.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [90]:
titanic.Survived.value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

### Задание

В датасете Titanic проверьте признак "Возраст"("Age") на выбросы (отрицательный возраст, посмотрите максимальный возраст - он правдоподобен?).  
Если там есть отсутствующие значения - на их место поставьте медианный возраст пассажиров.

In [ ]:
# Ваш код

---

### Создаем выборку обычным способом

In [91]:
titanic[(titanic.Age < 5) & (titanic.Sex == 'male')]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
64,0,3,"Skoog, Master. Harald",male,4.00,3,2,347088,27.9000,NaN,S
79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
165,0,3,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,39.6875,NaN,S
172,0,3,"Rice, Master. Arthur",male,4.00,4,1,382652,29.1250,NaN,Q
184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S
194,1,2,"Navratil, Master. Michel M",male,3.00,1,1,230080,26.0000,F2,S
262,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.00,4,2,347077,31.3875,NaN,S
306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
349,1,3,"Coutts, Master. William Loch ""William""",male,3.00,1,1,C.A. 37671,15.9000,NaN,S
387,0,3,"Goodwin, Master. Sidney Leonard",male,1.00,5,2,CA 2144,46.9000,NaN,S
408,1,2,"Richards, Master. William Rowe",male,3.00,1,1,29106,18.7500,NaN,S
446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S
756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
789,1,3,"Dean, Master. Bertram Vere",male,1.00,1,2,C.A. 2315,20.5750,NaN,S
804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
825,0,3,"Panula, Master. Urho Abraham",male,2.00,4,1,3101295,39.6875,NaN,S
828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S

#### Примеры использования  метода: `.query()`

In [92]:
titanic.query("Age < 5 and Sex == 'male'")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
64,0,3,"Skoog, Master. Harald",male,4.00,3,2,347088,27.9000,NaN,S
79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
165,0,3,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,39.6875,NaN,S
172,0,3,"Rice, Master. Arthur",male,4.00,4,1,382652,29.1250,NaN,Q
184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S
194,1,2,"Navratil, Master. Michel M",male,3.00,1,1,230080,26.0000,F2,S
262,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.00,4,2,347077,31.3875,NaN,S
306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
349,1,3,"Coutts, Master. William Loch ""William""",male,3.00,1,1,C.A. 37671,15.9000,NaN,S
387,0,3,"Goodwin, Master. Sidney Leonard",male,1.00,5,2,CA 2144,46.9000,NaN,S
408,1,2,"Richards, Master. William Rowe",male,3.00,1,1,29106,18.7500,NaN,S
446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S
756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
789,1,3,"Dean, Master. Bertram Vere",male,1.00,1,2,C.A. 2315,20.5750,NaN,S
804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
825,0,3,"Panula, Master. Urho Abraham",male,2.00,4,1,3101295,39.6875,NaN,S
828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S

In [93]:
titanic.query("Age < 5 and Sex == 'male'")['Ticket']

PassengerId
8               349909
17              382652
64              347088
79              248738
165            3101295
172             382652
184             230136
194             230080
262             347077
306             113781
341             230080
349         C.A. 37671
387            CA 2144
408              29106
446              33638
756             250649
789          C.A. 2315
804               2625
825            3101295
828    S.C./PARIS 2079
832              29106
851             347082
870             347742
Name: Ticket, dtype: object

In [94]:
titanic.query("Age < 5 and Sex == 'male'").Fare

PassengerId
8       21.0750
17      29.1250
64      27.9000
79      29.0000
165     39.6875
172     29.1250
184     39.0000
194     26.0000
262     31.3875
306    151.5500
341     26.0000
349     15.9000
387     46.9000
408     18.7500
446     81.8583
756     14.5000
789     20.5750
804      8.5167
825     39.6875
828     37.0042
832     18.7500
851     31.2750
870     11.1333
Name: Fare, dtype: float64

In [95]:
value = 5

In [96]:
# Используем значение переменной в .query()
titanic.query("0 < Age < @value and Sex == 'male'")['Ticket']

PassengerId
8               349909
17              382652
64              347088
79              248738
165            3101295
172             382652
184             230136
194             230080
262             347077
306             113781
341             230080
349         C.A. 37671
387            CA 2144
408              29106
446              33638
756             250649
789          C.A. 2315
804               2625
825            3101295
828    S.C./PARIS 2079
832              29106
851             347082
870             347742
Name: Ticket, dtype: object

In [97]:
# Переводим Series в DataFrame
titanic.query(f"Age < {value} and Sex == 'male'")['Ticket'].to_frame()

                      Ticket
PassengerId
8                     349909
17                    382652
64                    347088
79                    248738
165                  3101295
172                   382652
184                   230136
194                   230080
262                   347077
306                   113781
341                   230080
349               C.A. 37671
387                  CA 2144
408                    29106
446                    33638
756                   250649
789                C.A. 2315
804                     2625
825                  3101295
828          S.C./PARIS 2079
832                    29106
851                   347082
870                   347742

### Задание
Проанализируйте загруженные данные:

1. Сколько было на Титанике мужчин, женщин и несовершеннолетних детей(<18 лет)?
2. Действительно ли у пассажиров, путешествующих 3-м классом нет номеров кают?
3. Есть предположение, что женщин и детей не было среди путешествующих 3-м классом. Проверьте.

---

### Сохранение данных

Для сохранения датасетов в требуемом виде можно использовать следующие функции:
 - ```to_csv()``` - для сохранения данных в виде CSV
 - ```to_excel()``` - для сохранения данных в виде Excel Workbook \
...а также во можестве других форматов (см. документацию).
 
Также данные можно экспортировать в структуры Python и numpy:
 - ```to_dict()``` - этот метод вернет словарь с содержимым DataFrame, ровно в том же виде, чтобы из него можно было бы создать новый DataFrame
 - ```to_dict('records')``` - в данном случае этот метод вернет список словарей
 - ```to_numpy()``` - а этот метод можно использовать, если вам нужна матрица numpy
 - ```to_list()``` - в список